set_property SRC_FILE_INFO {cfile:C:/Users/Peachy/Desktop/SeniorProj/PyramidCon_x/solution2/impl/verilog/pyrconstuct_top.xdc rfile:../../pyrconstuct_top.xdc id:1 rxprname:$PPRDIR/pyrconstuct_top.xdc} [current_design]
set_property src_info {type:XDC file:1 line:1 export:INPUT save:INPUT read:READ} [current_design]
create_clock -period 5.000 -name ap_clk -waveform {0.000 2.500} [get_ports ap_clk]
set_property src_info {type:XDC file:1 line:2 export:INPUT save:INPUT read:READ} [current_design]
set_property HD.CLK_SRC BUFGCTRL_X0Y0 [get_ports ap_clk]
set_property src_info {type:XDC file:1 line:3 export:INPUT save:INPUT read:READ} [current_design]

set_property src_info {type:XDC file:1 line:4 export:INPUT save:INPUT read:READ} [current_design]
#set_input_delay 0 -clock CLK  [all_inputs]
set_property src_info {type:XDC file:1 line:5 export:INPUT save:INPUT read:READ} [current_design]
#set_output_delay 0 -clock CLK [all_outputs]
set_property src_info {type:XDC file:1 line:6 export:INPUT save:INPUT read:READ} [current_design]

set_property src_info {type:XDC file:1 line:7 export:INPUT save:INPUT read:READ} [current_design]

set_property src_info {type:XDC file:1 line:8 export:INPUT save:INPUT read:READ} [current_design]

